/**
 * Copyright (C), 2015-2020, 华规软件（上海）有限公司
 * FileName: AbstractErrorEnum
 * Author:   shenqicheng
 * Date:     2020/3/26 16:57
 * Description:
 * History:
 */
package com.huagui.common.base.exception;

import lombok.Getter;

/**
 * @author shenqicheng
 * @Date: 2020/3/26 16:57
 * @Description: 公共的code和message对应关系
 */
public enum MessageStatusEnum implements BaseMsgInfo {
    /**
     * 公共枚举
     */
    UNKNOWN(500, "服务器内部错误!"),
    OK(200, "操作成功!"),
    NOT_FOUND(500100, "未查询到此数据!"),
    /**
     * 用户异常错误码枚举
     */
    USER_NOT_PERMISSION(500200, "无当前权限!"),
    USER_NOT_EXISTS(500201, "用户未登陆或不存在!"),
    USER_EXISTS(500202, "用户已存在!"),
    USER_MOBILE_EXISTS(500203, "手机号已存在!"),
    /**
     * 服务异常错误码枚举
     */
    REQUIRED_PARAMETER(500300, "必传参数错误!"),
    ILLEGAL_REQUEST(500301, "非法的请求参数错误!"),
    PARAMETER_VALIDATION(500302, "字段验证错误!"),
    REQUEST_METHOD_NOT_SUPPORTED(500303, "不支持请求方法!"),
    DATABASE(500304, "字段重复，有外键关联，数据过长等!"),
    FEIGN(500305, "服务调用错误!"),
    WE_CHAT(500306, "微信调用错误!"),
    INVALID_METHOD_PARAMETER(500307, "方法参数无效!"),
    EXIST_DEFAULT_VALUE(500308, "该数据已存在默认值!"),
    DATA_EXIST(500309, "数据已存在!"),
    DATA_NOT_EXIST(500310, "数据不存在,请刷新后重试!"),
    NON_ADMIN_CANNOT_DELETE(500311, "非管理员无法删除记录!"),
    NAME_EXIST(500312, "数据重复!"),
    SERVICE_NOT_EXIST(500313, "服务不存在!"),
    REDIS_EXCEPTION(500314, "Redis异常"),
    /**
     * minIo
     */
    OSS_BUCKET(500501, "存储空间错误!"),
    OSS_DOWNLOAD(500502, "文件下载错误!"),
    OSS_OBJECT(500503, "对象操作错误!"),
    OSS_PRESIGNED(500504, "预约签名获取错误!"),
    OSS_UPLOAD(500505, "文件上传错误!"),

    /*================文档管理=500600================*/


    /*================项目oa=500700================*/
    /**
     * 流程实例相关(前端使用此code进行业务判断,不可修改)
     */
    ACT_UN_START(60001, "未启动流程实例"),


    /*================模型管理=500800================*/


    /*================投资管理=500900================*/


    /*================业务功能=501000================*/


    /*================移动端app=501100================*/


    /*================组织用户=501200================*/


    /*================权限管理=501300================*/


    /*================安全质量=501400================*/


    /*================整改管理=501500================*/


    /*================工程数据管理=501600================*/


    /*================勘察管理=501700================*/


    /*================基础信息管理=501800================*/


    /*================协同设计管理=501900================*/


    /*================工作流管理=502000================*/


    /*================报表系统=502100================*/


    /*================系统接口=502200================*/


    /*================资产移交=502300================*/


    /*================帮助编辑=502400================*/


    /*================项目概览=502500================*/


    /*================项目结构管理==502600===============*/


    /*================工程前期管理=502700================*/


    /*================首页=502800================*/


    /*================进度管理=502900================*/


    /*================excel导入导出=503000================*/
    EXCEL_IMPORT(503001, "excel导入错误!"),


    /**
     * 系统异常错误码枚举
     */
    OPERATION(500000, "服务器异常!");

    @Getter
    private Integer code;
    @Getter
    private String message;

    MessageStatusEnum(Integer code, String message) {
        this.code = code;
        this.message = message;
    }

}
